## Acessando Dataframes

#### O uso do loc[] (locate) é para índices (linhas) do dataframe
À frente, será visto que também pode-se usar a forma de acesso do numpy com ":"

#### Acessando por valor do indice, são retornadas todas as colunas da linha(índice) (Uma linha, uma dimensão) informado - Usando Pandas Series (Uma única dimensão)

In [1]:
# Criando dataframe de teste
import pandas as pd

students = [('Jack  ', 34, 'Sydney' , 'Australia'),
            ('Joshua', 30, 'Delhi' , 'India' ),
            ('Tom', 31, 'Mumbai' , 'India' ),
            ('Alicia', 32, 'Bangalore' , 'India' ),
            ('John', 16, 'New York' , 'US'),
            ('Osama', 17, 'las vegas' , 'US')]

df = pd.DataFrame(students, 
                columns = ['Name' , 'Age', 'City' , 'Country'])

print(df)

df.shape

     Name  Age       City    Country
0  Jack     34     Sydney  Australia
1  Joshua   30      Delhi      India
2     Tom   31     Mumbai      India
3  Alicia   32  Bangalore      India
4    John   16   New York         US
5   Osama   17  las vegas         US

(6, 4)

In [2]:
df.head(3)

     Name  Age    City    Country
0  Jack     34  Sydney  Australia
1  Joshua   30   Delhi      India
2     Tom   31  Mumbai      India

#### ELIMINANDO ESPAÇOS EM BRANCO

In [10]:
print(df['Name'].str.strip())
df['Name'] = df['Name'].str.strip()
print(df)

0      Jack
1    Joshua
2       Tom
3    Alicia
4      John
5     Osama
Name: Name, dtype: object
     Name  Age       City    Country
0    Jack   34     Sydney  Australia
1  Joshua   30      Delhi      India
2     Tom   31     Mumbai      India
3  Alicia   32  Bangalore      India
4    John   16   New York         US
5   Osama   17  las vegas         US

#### CONVERTENDO TIPOS PARA COLUNAS

In [4]:
# CONVERTENDO COLUNAS
df['Age'].astype('float')

0    34.0
1    30.0
2    31.0
3    32.0
4    16.0
5    17.0
Name: Age, dtype: float64

In [2]:
print(df.loc[0])
print()
print("Resultado exibido como: ",type(df.loc[0]))
print()

Name            Jack
Age               34
City          Sydney
Country    Australia
Name: 0, dtype: object

Resultado exibido como:  <class 'pandas.core.series.Series'>

In [6]:
print(df.loc[1:])

     Name  Age       City Country
1  Joshua   30      Delhi   India
2     Tom   31     Mumbai   India
3  Alicia   32  Bangalore   India
4    John   16   New York      US
5   Osama   17  las vegas      US

#### Sem header e sem índice

In [12]:
print(df.to_string(header=False,index=False))
print(type(df.to_string(header=False,index=False)))

  Jack 34    Sydney Australia
Joshua 30     Delhi     India
   Tom 31    Mumbai     India
Alicia 32 Bangalore     India
  John 16  New York        US
 Osama 17 las vegas        US
<class 'str'>

#### Acessando a última linha

In [ ]:
df.loc[df.index[-1]]

Name           Osama
Age               17
City       las vegas
Country           US
Name: 5, dtype: object

#### Acessando por valor do indice, são retornadas todas as colunas da linha(índice) informado - Usando Pandas Dataframe (Mais de uma dimensão)

In [5]:
print(df.loc[[0]])


df.loc[[0]]['Name'] = 'Antonio'
print('Acessando por nome: ',df.loc[[0]]['Name'])
print()

print("Resultado exibido como: ",type(df.loc[[0]]))

print()

   Name  Age    City    Country
0  Jack   34  Sydney  Australia
Acessando por nome:  0    Jack
Name: Name, dtype: object

Resultado exibido como:  <class 'pandas.core.frame.DataFrame'>

#### Acessando por linhas do indice (Mais de uma dimensão), são retornadas todas as colunas das linhas(índices) informadas

In [ ]:
print(df.loc[[1,3]])
print()
print("Resultado exibido como: ",type(df.loc[[1,3]]))
print()

     Name  Age       City Country
1  Joshua   30      Delhi   India
3  Alicia   32  Bangalore   India

Resultado exibido como:  <class 'pandas.core.frame.DataFrame'>

0    34
1    30
2    31
3    32
4    16
5    17
Name: Age, dtype: int64

#### Acessando uma linha com base no valor (Retorna um dataframe)

In [7]:
from pandas import DataFrame

print(df.loc[df['Name'] == 'Antonio'])
print(type(df.loc[df['Name'] == 'Osama']))
print(df.loc[df['Name'] == 'Osama','Name'].values[0])
print(df['Name'].str.upper())

print((df.loc[df['Name'].str.upper() == 'OSAMA','City'].str.upper() == 'RIO DE JANEIRO'))

Empty DataFrame
Columns: [Name, Age, City, Country]
Index: []
<class 'pandas.core.frame.DataFrame'>
Osama
0    JACK
1    JOSHUA
2       TOM
3    ALICIA
4      JOHN
5     OSAMA
Name: Name, dtype: object
5    False
Name: City, dtype: bool

In [4]:
print(df['Name'].str.contains('Osama'))
print(df.loc[df['Name'].str.contains('Osama')])

0    False
1    False
2    False
3    False
4    False
5     True
Name: Name, dtype: bool
    Name  Age       City Country
5  Osama   17  las vegas      US

In [2]:
print(df.values)

print('Usando for')
for r in df[['Name','Age']].values:
    print(r)
    

print(df['Name'].values)
print(df.loc[df['Name'] == 'Osama','Age'].values[0])
print(type(df.loc[df['Name'] == 'Osama']))

[['Jack  ' 34 'Sydney' 'Australia']
 ['Joshua' 30 'Delhi' 'India']
 ['Tom' 31 'Mumbai' 'India']
 ['Alicia' 32 'Bangalore' 'India']
 ['John' 16 'New York' 'US']
 ['Osama' 17 'las vegas' 'US']]
Usando for
['Jack  ' 34]
['Joshua' 30]
['Tom' 31]
['Alicia' 32]
['John' 16]
['Osama' 17]
['Jack  ' 'Joshua' 'Tom' 'Alicia' 'John' 'Osama']
17
<class 'pandas.core.frame.DataFrame'>

#### Acessando linhas por meio de condições

In [2]:
df = df.loc[(df['Country'] == "US") & (df['City'] == "New York") | (df['Country'] == 'India') & (df['City'].str.contains(r'Mum.*',regex=True))] # para o str, tem que ser Pandas Series
df

   Name  Age      City Country
2   Tom   31    Mumbai   India
4  John   16  New York      US

In [49]:
df['Name'] == 'Osama'

0    False
1    False
2    False
3    False
4    False
5     True
Name: Name, dtype: bool

#### Utilizando a sintaxe de fatiamento podemos alcançar os mesmos resultado da utilização do .loc com índice
Fatiamento -> semelhante a loc[], **logo se utiliza de índices também**
<br>Após o ":" é o tamanho

In [5]:
print(type(df[0:3]))
df[0:3]

<class 'pandas.core.frame.DataFrame'>

     Name  Age    City    Country
0  Jack     34  Sydney  Australia
1  Joshua   30   Delhi      India
2     Tom   31  Mumbai      India

In [52]:
df[0:]

     Name  Age       City    Country
0    Jack   34     Sydney  Australia
1  Joshua   30      Delhi      India
2     Tom   31     Mumbai      India
3  Alicia   32  Bangalore      India
4    John   16   New York         US
5   Osama   17  las vegas         US

#### Acessando colunas diretamente (o resultado é uma pandas.series)

In [9]:
df['Name']

0      Jack
1    Joshua
2       Tom
3    Alicia
4      John
5     Osama
Name: Name, dtype: object

In [8]:
print([i for i in df['Name']])

['Jack', 'Joshua', 'Tom', 'Alicia', 'John', 'Osama']

In [3]:
# semelhante ao anterior
df.Name

0      Jack
1    Joshua
2       Tom
3    Alicia
4      John
5     Osama
Name: Name, dtype: object

#### Acessando múltiplas colunas específicas
##### Só pode ser feito para dataframes, já que pandas.Series não possuem colunas

In [4]:
df[['Name','Country']]

     Name    Country
0    Jack  Australia
1  Joshua      India
2     Tom      India
3  Alicia      India
4    John         US
5   Osama         US

#### Acessando coluna com iloc

Essa é a única forma de acessar coluna pelo índice

In [ ]:
df.iloc[:,1]

0    34
1    30
2    31
3    32
4    16
5    17
Name: Age, dtype: int64

#### Acessando valor no dataframe

In [ ]:
print(df.loc[0,'Name']) # Linha zero coluna Name
print(type(df.loc[0, 'Name']))

Jack
<class 'str'>

#### OPERADOR ISIN

In [2]:

import pandas as pd

data1 = {
  "name": ["Sally", "Mary", "John"],
  "age": [50, 40, 30]
}

df1 = pd.DataFrame(data1)
print('Dataframe 1')
print(df1,'\n')

data2 = {
  "name": ["John", "Mary", "Sally"],
  "age": [30, 40, 50]
}

df2 = pd.DataFrame(data2)
print('Dataframe 2')
print(df2,'\n')

data3 = {
  "name": ["John"]
}

df3 = pd.DataFrame(data3)
print('Dataframe 3')
print(df3,'\n')

# SEMPRE A MELHOR MANEIRA DE FAZER A COMPARAÇÃO, POIS NAO IMPORTA A POSIÇÃO E NEM OS ÍNDICES DOS ELEMENTOS NO DATAFRAME
print(df3['name'].isin(df1['name']),'\n')
print(df1['name'].isin(df3['name']),'\n')
print(df1['name'].isin(["John"]),'\n')

print(df1.isin(df2),'\n')

print(all(list(df1.isin(df2))),'\n')

# USANDO SERIES, NÃO IMPORTA A ORDEM DOS REGISTROS
print(df2.isin([30,40,50]))
print(df2.isin([50,40,30]))

df2.loc[(df2.isin([50,40,30])['name'] == False).index]

Dataframe 1
    name  age
0  Sally   50
1   Mary   40
2   John   30

Dataframe 2
    name  age
0   John   30
1   Mary   40
2  Sally   50

Dataframe 3
   name
0  John

0    True
Name: name, dtype: bool

0    False
1    False
2     True
Name: name, dtype: bool

0    False
1    False
2     True
Name: name, dtype: bool

    name    age
0  False  False
1   True   True
2  False  False

True

    name   age
0  False  True
1  False  True
2  False  True
    name   age
0  False  True
1  False  True
2  False  True

    name  age
0   John   30
1   Mary   40
2  Sally   50

#### OPERADOR ISNA

In [1]:
# Criando dataframe de teste
import pandas as pd

students = [('Jack  ', None, 'Sydney' , None),
            ('Joshua', 30, 'Delhi' , 'India' ),
            ('Tom', 31, 'Mumbai' , 'India' ),
            ('Alicia', 32, 'Bangalore' , 'India' ),
            ('John', 16, 'New York' , 'US'),
            ('Osama', 17, 'las vegas' , 'US')]

df = pd.DataFrame(students, 
                columns = ['Name' , 'Age', 'City' , 'Country'])

print(df)

df.shape

     Name   Age       City Country
0  Jack     NaN     Sydney    None
1  Joshua  30.0      Delhi   India
2     Tom  31.0     Mumbai   India
3  Alicia  32.0  Bangalore   India
4    John  16.0   New York      US
5   Osama  17.0  las vegas      US

(6, 4)

In [9]:
print(df['Country'].isna())
df['Country'].isna().any()

0     True
1    False
2    False
3    False
4    False
5    False
Name: Country, dtype: bool

np.True_

#### Aplicar funções em linhas / colunas
[Método Apply](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html#pandas-dataframe-apply) Aplique uma função ao longo de um eixo do DataFrame.<br>
Por padrão, a função é aplicada em <b>TODAS</b> as colunas. Para aplicar em linhas, utilize o parâmetro axis = 1

In [ ]:
import pandas as pd


def calc_sum(x):
  return sum(x)

data = {
  "x": [50, 40, 30],
  "y": [300, 1112, 42]
}

df = pd.DataFrame(data)
print("df\n",df)

df.apply(calc_sum)

df
     x     y
0  50   300
1  40  1112
2  30    42

x     120
y    1454
dtype: int64

In [87]:
import pandas as pd
  
data = {
  "x": [300, 1112, 42],
  "y" : [1,2,3]
}

df = pd.DataFrame(data)
print("df\n",df)

df['tamanho'] = df.astype(str).apply(lambda row : row.str.len().sum(), axis=1)
tamanho_maximo = df['tamanho'].max()
indice = df.loc[df['tamanho'] == tamanho_maximo].index[0]
print('\n',df)
print("Indice: ",indice)
print(df.loc[[1]].to_string(header=False,index=False))

df
       x  y
0   300  1
1  1112  2
2    42  3

       x  y  tamanho
0   300  1        4
1  1112  2        5
2    42  3        3
Indice:  1
1112 2 5

### Outros Exemplos de aplicação

#### Raíz quadrada

In [58]:
# aplicar a raiz quadrada em todas as colunas(que sejam numéricas)

## Criar dataframes
import numpy as np

frame_data = {'A': [1, 2, 3], 'B': [18, 20, 22], 'C': [54, 12, 13]}

df = pd.DataFrame(frame_data)

print(df)
print()

   A   B   C
0  1  18  54
1  2  20  12
2  3  22  13

In [59]:

df.apply(np.sqrt)

          A         B         C
0  1.000000  4.242641  7.348469
1  1.414214  4.472136  3.464102
2  1.732051  4.690416  3.605551

#### Aplicar soma

In [57]:

df.apply(np.sum)

A     6
B    60
C    79
dtype: int64

## Manipulando Dataframes

### Adicionar colunas ao Dataframe do Pandas

### Método 1 - Adicionar uma coluna ao Dataframe do Pandas com um valor padrão.
**Formas de fazer** <br>
1. Declarando uma lista como uma nova coluna <br>
2. Utilizando loc (Você pode usar '.loc' com ':' para adicionar um valor <br> especificado para todas as linhas.). Será visto em Manipulando Dataframes <br>
3. Utilizando .assign() <br>
4. Utilizando .insert() <br>

In [25]:
# Criando dataframe de teste

import pandas as pd

students = [('Jack', 34, 'Sydney' , 'Australia'),
            ('Joshua', 30, 'Delhi' , 'India' ),
            ('Tom', 31, 'Mumbai' , 'India' ),
            ('Alicia', 32, 'Bangalore' , 'India' ),
            ('John', 16, 'New York' , 'US'),
            ('Osama', 17, 'las vegas' , 'US')]

df = pd.DataFrame(students, 
                columns = ['Name' , 'Age', 'City' , 'Country'], 
                index=['a', 'b', 'c' , 'd' , 'e' , 'f'])
df

     Name  Age       City    Country
a    Jack   34     Sydney  Australia
b  Joshua   30      Delhi      India
c     Tom   31     Mumbai      India
d  Alicia   32  Bangalore      India
e    John   16   New York         US
f   Osama   17  las vegas         US

#### 1. Declarando uma lista como uma nova coluna

In [27]:
df['School'] = 'Training'
df

     Name  Age       City    Country    School
a    Jack   34     Sydney  Australia  Training
b  Joshua   30      Delhi      India  Training
c     Tom   31     Mumbai      India  Training
d  Alicia   32  Bangalore      India  Training
e    John   16   New York         US  Training
f   Osama   17  las vegas         US  Training

### 2. Utilizando loc
#### Itens permitidos a atribuição
<li>Um elemento single, como um caracter ou um numero
<li>Uma lista ou array
<li>Um fatiamento de objetos
<li> Também se pode utilizar o fatiamento do Numpy

In [28]:
df.loc[:,'Grade'] = 'A'
df

     Name  Age       City    Country    School Grade
a    Jack   34     Sydney  Australia  Training     A
b  Joshua   30      Delhi      India  Training     A
c     Tom   31     Mumbai      India  Training     A
d  Alicia   32  Bangalore      India  Training     A
e    John   16   New York         US  Training     A
f   Osama   17  las vegas         US  Training     A

#### 3. Utilizando .assign()

In [29]:
df = df.assign(Duration_months='24')
df

     Name  Age       City    Country    School Grade Duration_months
a    Jack   34     Sydney  Australia  Training     A              24
b  Joshua   30      Delhi      India  Training     A              24
c     Tom   31     Mumbai      India  Training     A              24
d  Alicia   32  Bangalore      India  Training     A              24
e    John   16   New York         US  Training     A              24
f   Osama   17  las vegas         US  Training     A              24

#### 4. Utilizando .insert()
**DataFrame.insert(loc, column, value, allow_duplicates=True)**
#####  Parametros para insert
<li>loc: loc é um inteiro que é a localização de uma coluna onde queremos inserir uma nova coluna (Começa em zero). Isso mudará a coluna existente naquela posição para a direita.<br>
<li>column: uma string que é o nome de uma coluna a ser inserida.<br>
<li>value: valor é simplesmente o valor a ser inserido. Pode ser um inteiro, uma string, um float ou mesmo uma série/lista de valores. Fornecer apenas um valor definirá o mesmo valor para todas as linhas.<br><br>

**allow_duplicates**: é um valor booleano que verifica se uma coluna com o mesmo nome já existe ou não.

In [30]:
# Loc=1 é a posição que a coluna entrará
df.insert(loc=1, 
        column='Start_year', 
        value='2017',allow_duplicates=False)
df

,Name,Start_year,Age,City,Country,School,Grade,Duration_months
a,Jack,2017,34,Sydney,Australia,Training,A,24
b,Joshua,2017,30,Delhi,India,Training,A,24
c,Tom,2017,31,Mumbai,India,Training,A,24
d,Alicia,2017,32,Bangalore,India,Training,A,24
e,John,2017,16,New York,US,Training,A,24
f,Osama,2017,17,las vegas,US,Training,A,24

### Método 2 - Adicionar uma coluna ao Dataframe do Pandas com valores diferentes

#### 1. Declarando uma lista como uma nova coluna

In [31]:
# 1. Declarando uma lista como uma nova coluna
df['Final_grade'] = ['A','D','B','A','A','C']
df

,Name,Start_year,Age,City,Country,School,Grade,Duration_months,Final_grade
a,Jack,2017,34,Sydney,Australia,Training,A,24,A
b,Joshua,2017,30,Delhi,India,Training,A,24,D
c,Tom,2017,31,Mumbai,India,Training,A,24,B
d,Alicia,2017,32,Bangalore,India,Training,A,24,A
e,John,2017,16,New York,US,Training,A,24,A
f,Osama,2017,17,las vegas,US,Training,A,24,C

### 2. Utilizando loc
#### Itens permitidos a atribuição
<li>Um elemento singles, como um caracter ou um numero
<li>Uma lista ou array
<li>Um fatiamento de objetos
<li> Também se pode utilizar o fatiamento do Numpy

In [32]:
df.loc[:, 'Final_Year'] = [2020,2021,2021,2021,2020,2018]
df

,Name,Start_year,Age,City,Country,School,Grade,Duration_months,Final_grade,Final_Year
a,Jack,2017,34,Sydney,Australia,Training,A,24,A,2020
b,Joshua,2017,30,Delhi,India,Training,A,24,D,2021
c,Tom,2017,31,Mumbai,India,Training,A,24,B,2021
d,Alicia,2017,32,Bangalore,India,Training,A,24,A,2021
e,John,2017,16,New York,US,Training,A,24,A,2020
f,Osama,2017,17,las vegas,US,Training,A,24,C,2018

#### 3. Utilizando .assign()

In [33]:
df = df.assign(Family_income_per_year=[100000,80000,150000,60000,123000,65000])
df

,Name,Start_year,Age,City,Country,School,Grade,Duration_months,Final_grade,Final_Year,Family_income_per_year
a,Jack,2017,34,Sydney,Australia,Training,A,24,A,2020,100000
b,Joshua,2017,30,Delhi,India,Training,A,24,D,2021,80000
c,Tom,2017,31,Mumbai,India,Training,A,24,B,2021,150000
d,Alicia,2017,32,Bangalore,India,Training,A,24,A,2021,60000
e,John,2017,16,New York,US,Training,A,24,A,2020,123000
f,Osama,2017,17,las vegas,US,Training,A,24,C,2018,65000

#### 4. Utilizando .insert()
**DataFrame.insert(loc, column, value, allow_duplicates=False)**

In [34]:
# Loc=1 é a posição que a coluna entrará
df.insert(loc=1, 
          column='Class', 
          value=[1,2,2,2,1,3])
df

,Name,Class,Start_year,Age,City,Country,School,Grade,Duration_months,Final_grade,Final_Year,Family_income_per_year
a,Jack,1,2017,34,Sydney,Australia,Training,A,24,A,2020,100000
b,Joshua,2,2017,30,Delhi,India,Training,A,24,D,2021,80000
c,Tom,2,2017,31,Mumbai,India,Training,A,24,B,2021,150000
d,Alicia,2,2017,32,Bangalore,India,Training,A,24,A,2021,60000
e,John,1,2017,16,New York,US,Training,A,24,A,2020,123000
f,Osama,3,2017,17,las vegas,US,Training,A,24,C,2018,65000

##### Obs: No caso de value ser série/Dataframe, a quantidade de valores deve corresponder ao número de linhas do DataFrame e possuirem o mesmo índice

In [ ]:
dfnota = pd.DataFrame([1,2,3,4,5,6],columns=['Peso Nota'],index=['a','b','c','d','e','f']) # ESPECIFICANDO O INDEX PARA FICAR IGUAL, SE NÃO A NOAVA COLUNA
                                                                                           # FICA COM VALORES NaN

df.insert(loc=2,column='Peso',value=dfnota)
df

,Name,Class,Peso,Start_year,Age,City,Country,School,Grade,Duration_months,Final_grade,Final_Year,Family_income_per_year
a,Jack,1,1,2017,34,Sydney,Australia,Training,A,24,A,2020,100000
b,Joshua,2,2,2017,30,Delhi,India,Training,A,24,D,2021,80000
c,Tom,2,3,2017,31,Mumbai,India,Training,A,24,B,2021,150000
d,Alicia,2,4,2017,32,Bangalore,India,Training,A,24,A,2021,60000
e,John,1,5,2017,16,New York,US,Training,A,24,A,2020,123000
f,Osama,3,6,2017,17,las vegas,US,Training,A,24,C,2018,65000

### Modificando o nome de uma coluna

In [5]:
df.rename(columns={'Country':'País'},inplace=True)
df

     Name  Age       City       País
0    Jack   34     Sydney  Australia
1  Joshua   30      Delhi      India
2     Tom   31     Mumbai      India
3  Alicia   32  Bangalore      India
4    John   16   New York         US
5   Osama   17  las vegas         US

### Adicionar linhas ao Dataframe do Pandas

In [1]:
# Criando dataframe de teste

import pandas as pd

students = [('Jack', 34, 'Sydney' , 'Australia'),
            ('Joshua', 30, 'Delhi' , 'India' ),
            ('Tom', 31, 'Mumbai' , 'India' ),
            ('Alicia', 32, 'Bangalore' , 'India' ),
            ('John', 16, 'New York' , 'US'),
            ('Osama', 17, 'las vegas' , 'US')]

df = pd.DataFrame(students, 
                columns = ['Name' , 'Age', 'City' , 'Country'])
df

     Name  Age       City    Country
0    Jack   34     Sydney  Australia
1  Joshua   30      Delhi      India
2     Tom   31     Mumbai      India
3  Alicia   32  Bangalore      India
4    John   16   New York         US
5   Osama   17  las vegas         US

In [2]:
df.loc[df['Name'] == 'Jack','Age'] = 48
df

     Name  Age       City    Country
0    Jack   48     Sydney  Australia
1  Joshua   30      Delhi      India
2     Tom   31     Mumbai      India
3  Alicia   32  Bangalore      India
4    John   16   New York         US
5   Osama   17  las vegas         US

### Método 1 - Inserindo uma linha por meio de um dataframe

A estrutura de dados do dataframe que representa a nova linha, precisa ser a mesma do dataframe ao qual se quer adicionar a nova linha.</br>
<br>Ex: Se o dataframe original é uma lista de tuplas, o dataframe que representa a nova linha, também deverá ser.

<b>[df = pd.concat([df, new_record], ignore_index=True)](https://pandas.pydata.org/docs/reference/api/pandas.concat.html)</b>
<br><br> O ignore_index, no caso de True, é para fazer a contagem a partir do último índice do dataframe

In [116]:
nova_linha = [('Antonio',46,'Rio de Janeiro','Brasil')]

df_nova_linha = pd.DataFrame(nova_linha,columns = df.columns)

df = pd.concat([df,df_nova_linha],ignore_index=True)
df

      Name  Age            City    Country
0     Jack   34          Sydney  Australia
1   Joshua   30           Delhi      India
2      Tom   31          Mumbai      India
3   Alicia   32       Bangalore      India
4     John   16        New York         US
5    Osama   17       las vegas         US
6  Antonio   46  Rio de Janeiro     Brasil

### Método 2 - Inserindo uma nova linha por meio de uma lista - Pandas Series

In [2]:
print('Tamanho do dataframe: ',len(df))

df.loc[len(df)] = ['Enzo',10,'Rio de Janeiro','Brasil']
print(df)

print("O último registro é do tipo: ",type(df.loc[df.index[-1]]))

Tamanho do dataframe:  6
     Name  Age            City    Country
0    Jack   34          Sydney  Australia
1  Joshua   30           Delhi      India
2     Tom   31          Mumbai      India
3  Alicia   32       Bangalore      India
4    John   16        New York         US
5   Osama   17       las vegas         US
6    Enzo   10  Rio de Janeiro     Brasil
O último registro é do tipo:  <class 'pandas.core.series.Series'>

### Inserindo uma linha no topo

df = pd.concat(<b>[new_record,df]</b>,ignore_index=True) </br>

In [118]:
nova_linha = [('Liana',47,'Rio de Janeiro','Brasil')]
df_nova_linha = pd.DataFrame(nova_linha,columns = df.columns)

df = pd.concat([df_nova_linha,df],ignore_index=True)
df

      Name  Age            City    Country
0    Liana   47  Rio de Janeiro     Brasil
1     Jack   34          Sydney  Australia
2   Joshua   30           Delhi      India
3      Tom   31          Mumbai      India
4   Alicia   32       Bangalore      India
5     John   16        New York         US
6    Osama   17       las vegas         US
7  Antonio   46  Rio de Janeiro     Brasil
8     Enzo   10  Rio de Janeiro     Brasil

## Modificando um determinado valor

### 1. Utilizando loc

<li>Perceba que é por meio de Pandas.Series (loc[]) e não dataframe ([loc[]]) </li>

In [11]:
print(df)

# Acessando e modificando o valor na linha 1, coluna 'Coluna2'
df.loc[0, 'Name'] = 'Antonio'
df

df[df['Country'] == 'US']

      Name  Age       City    Country
0  Antonio   34     Sydney  Australia
1   Joshua   30      Delhi      India
2      Tom   31     Mumbai      India
3   Alicia   32  Bangalore      India
4     John   16   New York         US
5    Osama   17  las vegas         US

    Name  Age       City Country
4   John   16   New York      US
5  Osama   17  las vegas      US

## Leading zeros on spreadsheets cells for pandas

(https://stackoverflow.com/questions/75799572/python-how-to-preserve-leading-zeroes-when-reading-in-pandas-a-0000000000-form)

In [1]:
import pandas as pd


data = {'Column1': ['1', '2', '3']}

df = pd.DataFrame(data)
df['Column1'] = df['Column1'].str.zfill(6)
print(df)

  Column1
0  000001
1  000002
2  000003

## Duplicatas

#### Verificando duplicatas

In [12]:
# Criando o dataset

import pandas as pd

frame_data = {'nome'  : ['Berry', 'Kara', 'Clark', 'Berry'], 
              'idade' : [28, 32, 52, 28], 
              'função': ['Office Boy', 'Enfermeira', 'Ascensorista', 'Office Boy']}

df = pd.DataFrame(frame_data)
df

    nome  idade        função
0  Berry     28    Office Boy
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista
3  Berry     28    Office Boy

In [3]:
# Verificado se existem registros duplicados
df.duplicated()

0    False
1    False
2    False
3     True
dtype: bool

#### Removendo registros duplicados
[Método drop_duplicates](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop_duplicates.html#pandas-dataframe-drop-duplicates) Retorne DataFrame com linhas duplicadas removidas.

In [13]:
print(df.drop_duplicates())

    nome  idade        função
0  Berry     28    Office Boy
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista

#### Atenção: por padrão o método drop_duplicates retorna um dataframe temporário em memória, então se quiser gerar um novo dataframe, faça uma atribuição para uma nova variável.
#### Caso você queira atualizar o dataframe atual, você deve utilizar o parâmetro inplace. (Como se fosse um commit)

In [47]:
# Se for positivo, podemos remover os duplicados utilizando o metodo
df_no_duplicates = df.drop_duplicates()
df_no_duplicates

    nome  idade        função
0  Berry     28    Office Boy
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista

In [48]:
# O dataframe original continua igual
df

    nome  idade        função
0  Berry     28    Office Boy
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista
3  Berry     28    Office Boy

In [49]:
# Para alterar diretamente no dataframe
# Atenção a regra do inplace. 
# Escolhe remover a última ocorrência.

df.drop_duplicates(inplace=True)

In [50]:
df

    nome  idade        função
0  Berry     28    Office Boy
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista

#### Eliminar duplicidade por coluna
##### Não necessariamente é uma duplicata perfeita. (Todos os valores iguais a outro registro)

In [109]:
# Criando o dataframe
import pandas as pd

frame_data = {'nome'  : ['Berry', 'Kara', 'Clark', 'Berry'], 
              'idade' : [28, 32, 52, 27], 
              'função': ['Office Boy', 'Enfermeira', 'Ascensorista', 'Office Boy']}
df = pd.DataFrame(frame_data)
df

    nome  idade        função
0  Berry     28    Office Boy
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista
3  Berry     27    Office Boy

In [110]:
df.drop_duplicates(['nome'])

    nome  idade        função
0  Berry     28    Office Boy
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista

## Excluindo
[Método Drop](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html#pandas-dataframe-drop) Remova os rótulos especificados das linhas ou colunas. Por padrão o drop remove por índice, **para remover por coluna use o parâmetro axis=1.**<br>

inplace: bool, Se for False, retorne uma cópia. Caso contrário, execute a operação no local.

#### Excluindo linha

#### Por índice

In [111]:
df

    nome  idade        função
0  Berry     28    Office Boy
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista
3  Berry     27    Office Boy

In [112]:
df.drop(index=[1,3])

    nome  idade        função
0  Berry     28    Office Boy
2  Clark     52  Ascensorista

#### Método index

In [113]:
df.drop(df.index[[0,2]])

    nome  idade      função
1   Kara     32  Enfermeira
3  Berry     27  Office Boy

#### Excluindo última linha

In [104]:
df.drop(df.index[-1])

    nome  idade        função
0  Berry     28    Office Boy
1   Kara     32    Enfermeira
2  Clark     52  Ascensorista

#### Por nome do índice

In [11]:
#Criando o dataframe
import pandas as pd

frame_data = {'nome'  : ['Berry', 'Kara', 'Clark', 'Berry'], 
              'idade' : [28, 32, 52, 27], 
              'função': ['Office Boy', 'Enfermeira', 'Ascensorista', 'Office Boy']}

df = pd.DataFrame(frame_data,index=['Berry','Kara','Clark','Berry'])
df

        nome  idade        função
Berry  Berry     28    Office Boy
Kara    Kara     32    Enfermeira
Clark  Clark     52  Ascensorista
Berry  Berry     27    Office Boy

In [116]:
# Apagando registros utilizando o nome no indice
df.drop(index=['Clark'])

        nome  idade      função
Berry  Berry     28  Office Boy
Kara    Kara     32  Enfermeira
Berry  Berry     27  Office Boy

In [12]:
# Apagando um registro pelo critério de busca
print(df)
print((df.loc[df['nome'] == 'Berry']).index)
df.drop(labels=(df.loc[df['nome'] == 'Berry']).index[0],inplace=True)
df

        nome  idade        função
Berry  Berry     28    Office Boy
Kara    Kara     32    Enfermeira
Clark  Clark     52  Ascensorista
Berry  Berry     27    Office Boy
Index(['Berry', 'Berry'], dtype='object')

        nome  idade        função
Kara    Kara     32    Enfermeira
Clark  Clark     52  Ascensorista

#### Excluindo coluna

In [19]:
import numpy as np

df = pd.DataFrame(np.arange(12).reshape(3, 4),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [ ]:
df.drop(columns=['B', 'C'])

   A   D
0  0   3
1  4   7
2  8  11

In [7]:
# Apagar colunas
df.drop(['B', 'C'], axis=1)

   A   D
0  0   3
1  4   7
2  8  11

In [3]:
# Criando o dataframe
import pandas as pd

frame_data = {'nome': ['Berry', 'Kara', 'Clark'], 
              'idade': [28, 32, 52], 
              'função': ['Office Boy', 'Enfermeira', 'Ascensorista']}

df = pd.DataFrame(frame_data, index = ['Berry', 'Kara', 'Clark'])
df

        nome  idade        função
Berry  Berry     28    Office Boy
Kara    Kara     32    Enfermeira
Clark  Clark     52  Ascensorista

In [118]:
df.drop(columns=['nome'])

       idade        função
Berry     28    Office Boy
Kara      32    Enfermeira
Clark     52  Ascensorista

## Identificando Nulos

In [8]:
print(df)

print(df.isnull())

df['idade'] = None

print(df)

print(df.isnull())
print(df.isnull()['idade'])
print(df.isnull()['idade'].any())

        nome idade        função
Berry  Berry  None    Office Boy
Kara    Kara  None    Enfermeira
Clark  Clark  None  Ascensorista
        nome  idade  função
Berry  False   True   False
Kara   False   True   False
Clark  False   True   False
        nome idade        função
Berry  Berry  None    Office Boy
Kara    Kara  None    Enfermeira
Clark  Clark  None  Ascensorista
        nome  idade  função
Berry  False   True   False
Kara   False   True   False
Clark  False   True   False
Berry    True
Kara     True
Clark    True
Name: idade, dtype: bool
True

#### Soma de colunas (Para Pandas Series)
[Método Sum](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sum.html#pandas-dataframe-sum) Retorna a soma dos valores sobre o eixo solicitado.

In [1]:
# Criando o dataframe
import pandas as pd

frame_data = {'A': [23, 12, 12], 'B': [18, 18, 22], 'C': [13, 112, 13]}

df = pd.DataFrame(frame_data)
df

    A   B    C
0  23  18   13
1  12  18  112
2  12  22   13

In [27]:
df['A'].sum()

47

#### Soma de linhas

In [39]:
df.loc[0].sum()

54

#### Contagem de valores únicos
[Método nunique](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.nunique.html#pandas-dataframe-nunique) Conte observações distintas sobre o **eixo** solicitado. Por padrão, é a coluna. axis = 0, ou vazio

#### Por coluna

In [45]:
print(df)

df.nunique()

    A   B    C
0  23  18   13
1  12  18  112
2  12  22   13

A    2
B    2
C    2
dtype: int64

#### Por coluna específica

In [63]:
print(df)
df['A'].nunique()

    A   B    C
0  23  18   13
1  12  18  112
2  12  22   13

2

#### Por linha

In [51]:
print(df)
print(df.nunique(axis=1))

    A   B    C
0  23  18   13
1  12  18  112
2  12  22   13

0    3
1    3
2    3
dtype: int64

In [2]:
import pandas as pd

# Sample DataFrame
df = pd.DataFrame({'col1': [1, 2, 3], 'col2': [4, 5, 6]})
print('df')
print(df)

print(df.columns)

# Move header to the first row of data
header_row = pd.DataFrame([df.columns])  # Create a DataFrame from headers

print('Header row')
print(header_row)

#df_without_header = pd.concat(
#    [header_row, df], ignore_index=True)  # Concatenate

#print('df_without_header')
#print(df_without_header)

df
   col1  col2
0     1     4
1     2     5
2     3     6
Index(['col1', 'col2'], dtype='object')
Header row
      0     1
0  col1  col2

In [5]:
from datetime import date

dia = str(date.today()).split('-',1)[1].split('-',1)[1]
mes = str(date.today()).split('-',1)[1].split('-',1)[0]

print(dia)
print(mes)

04
12